Tekla Open API Reference for Tekla Structures 2025
Distance.UnitType Enumeration
 The distance units.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum UnitType
Public Enumeration UnitType
Members
Member name | Value | Description
Millimeter | 0 |  The millimeter unit type.
Centimeter | 1 |  The centimeter unit type.
Meter | 2 |  The meter unit type.
Inch | 3 |  The inch unit type.
Foot | 4 |  The foot unit type.
UsSurveyInch | 5 |  The US survey inch unit type.
UsSurveyFoot | 6 |  The US survey foot unit type.
See Also
Reference
Tekla.Structures.Datatype Namespace